БухЭксп/InformationRegisters/CW_УтверждениеБюджетов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>CW_УтверждениеБюджетов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_Заявки</v8:Type>
						<v8:Type>cfg:CatalogRef.CW_Заказы</v8:Type>
						<v8:Type>cfg:CatalogRef.CW_Грузоперевозки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВерсияБюджета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ВариантыБюджетовПоЗаявкам</v8:Type>
						<v8:Type>cfg:CatalogRef.CW_ВерсииБюджетов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

БухЭксп/InformationRegisters/CW_УтверждениеБюджетов/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
Функция ПолучитьБлокировкуБюджета(Объект, ВерсияБюджета) Экспорт
		
    Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	               |	CW_УтверждениеБюджетов.Объект КАК Объект,
	               |	CW_УтверждениеБюджетов.ВерсияБюджета КАК ВерсияБюджета
	               |ИЗ
	               |	РегистрСведений.CW_УтверждениеБюджетов КАК CW_УтверждениеБюджетов
	               |ГДЕ
	               |	CW_УтверждениеБюджетов.Объект = &Объект
	               |	И CW_УтверждениеБюджетов.ВерсияБюджета = &ВерсияБюджета";  
	
	Запрос.УстановитьПараметр("Объект", 		Объект);
	Запрос.УстановитьПараметр("ВерсияБюджета", 	ВерсияБюджета); 
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат Не РезультатЗапроса.Пустой();
	
КонецФункции
	
#КонецЕсли
